IDEA Open Model
ConcreteULSCheckResultTorsionEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 ULS Check Torsion Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsion
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteULSCheckResultTorsionEc2 : ConcreteULSCheckResultTorsion
Public Class ConcreteULSCheckResultTorsionEc2
	Inherits ConcreteULSCheckResultTorsion
The ConcreteULSCheckResultTorsionEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultTorsionEc2
Initializes a new instance of the ConcreteULSCheckResultTorsionEc2 class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Ted
 Design value of the applied torsional moment
Trd
 decisive design torsional resistance
Trdc
 torsional cracking moment
Trdmax
 design torsional resistance moment
Trds
 design torsional resistance moment of shear reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace